<template>
  <h1>组件注册</h1>
  <p>
    一个 Vue 组件在使用前需要先被 “注册”，这样 Vue 才能在渲染模板时找到其对应的实现。
    组件注册用两种方式：全局注册和局部注册。
  </p>

  <h2>全局注册</h2>
  <p>我们可以使用 Vue 应用实例的 .component() 方法，让组件在当前 Vue 应用中全局可用。</p>
  <p>如果使用单文件组件，你可以注册被导入的 .vue 文件。</p>
  <p>.component() 方法，可以被链式调用：</p>
  <p>全局注册的组件可以在此应用的任意组件的模板中使用：</p>
  <p>所有的子组件也可以使用全局注册的组件，这意味着这三个组件也都可以在彼此内部使用。</p>

  <h2>局部注册</h2>
  <p>全局注册虽然很方便，但有以下几个问题：</p>
  <ol>
    <dl>全局注册，但并没有被使用的组件无法在生产打包是被自动移除（也叫“tree-shaking”）。如果你全局注册一个组件，即使它并没有实际使用，它仍然会出现在打包后的 JS 文件中。</dl>
    <dl>全局注册在大型项目中使项目的依赖关系变得不那么明确。在父组件中使用子组件时，不太容易定位子组件的实现。和使用过多的全局变量一样，这可能会影响用长期的可维护性。</dl>
  </ol>
  <p>相比之下，局部注册的组件需要再使用他的父组件中显式导入，并且只能该父组件中使用。他的有点是使组件之间的依赖关系更加明确，并且对 tree-shaking 更加友好。</p>
  <p>在使用 script setup 的单文件组件中，导入的组件可以直接在模板中使用，无需注册：</p>
  <p>如果没有使用 script setup， 则需要使用 components 选项来显式注册。</p>
</template>
